app/controllers/password_resets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "example@railstutorial.org"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$e1uUK.fF4WNLnHKg80PqG.gK970GOnaArPuPAznu2xouj7StCuXeG"], ["updated_at", "2020-07-31 21:11:28.561257"], ["id", 21]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, :blank)
      render 'edit'
    elsif @user.update_attributes(user_params)